ProgessBase/Documents/ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизации</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПРГ_СведенияОбАттестацииСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПРГ_ВидыОперацииДокументаАттестацииСотрудниковОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАттестации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГ_ВидыАттестацииСотрудниковОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАттестации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидАттестации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПРГ_ВидыАттестацииСотрудниковОрганизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаОбучения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияОбучения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаАттестации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШЕ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AVT_ШтатноеРасписание</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицадляЗаполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидАттестации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПРГ_ВидыАттестацииСотрудниковОрганизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШЕ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AVT_ШтатноеРасписание</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ProgessBase/InformationRegisters/ПРГ_СведенияОбАттестацииСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПРГ_СведенияОбАттестацииСотрудников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидОперацииДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПРГ_ВидыОперацииДокументаАттестацииСотрудниковОрганизации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШЕ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AVT_ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАттестации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГ_ВидыАттестацииСотрудниковОрганизации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаКОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаАттестации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/Enums/ПРГ_ВидыОперацииДокументаАттестацииСотрудниковОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ПРГ_ВидыОперацииДокументаАттестацииСотрудниковОрганизации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аттестация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обучение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодлежитАттестации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/Documents/ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизации/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;

Процедура СформироватьДвижения()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизацииСотрудники.Ссылка.ВидОперации как ВидОперации,
	|	ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизацииСотрудники.Сотрудник как Сотрудник,
	|	ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизацииСотрудники.ВидАттестации как ВидАттестации,
	|	ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизацииСотрудники.ДатаНачалаОбучения как ДатаНачалаОбучения,
	|	ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизацииСотрудники.ДатаОкончанияОбучения как ДатаОкончанияОбучения,
	|	ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизацииСотрудники.ДатаАттестации как ДатаАттестации,
	|	ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизацииСотрудники.ШЕ как ШЕ
	|ИЗ
	|	Документ.ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизации.Сотрудники КАК ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизацииСотрудники
	|ГДЕ
	|	ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизацииСотрудники.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей       = РегистрыСведений.ПРГ_СведенияОбАттестацииСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	
	Пока Выборка.Следующий() Цикл
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.Регистратор = Ссылка;
		НоваяЗапись.ВидАттестации  = ВидАттестации;
		НоваяЗапись.ВидОперацииДокумента = ВидОперации;
		НоваяЗапись.Сотрудник = Выборка.Сотрудник;
		НоваяЗапись.ШЕ = Выборка.ШЕ;
		Если ВидОперации = Перечисления.ПРГ_ВидыОперацииДокументаАттестацииСотрудниковОрганизации.Обучение Тогда
			НоваяЗапись.ДатаНОбучения = Выборка.ДатаНачалаОбучения;
			НоваяЗапись.ДатаКОбучения = Выборка.ДатаОкончанияОбучения;
		ИначеЕсли ВидОперации = Перечисления.ПРГ_ВидыОперацииДокументаАттестацииСотрудниковОрганизации.Аттестация Тогда
			НоваяЗапись.ДатаАттестации = Выборка.ДатаАттестации;
		КонецЕсли;
		
	КонецЦикла;
	НаборЗаписей.Записать();       
	Если ВидОперации = Перечисления.ПРГ_ВидыОперацииДокументаАттестацииСотрудниковОрганизации.Аттестация Тогда
		ДописатьДатуАттестацииВЛОбучении();
	КонецЕсли;
КонецПроцедуры

Процедура ДописатьДатуАттестацииВЛОбучении()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизацииСотрудники.Ссылка.ВидОперации КАК ВидОперации,
	|	ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизацииСотрудники.Сотрудник КАК Сотрудник,
	|	ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизацииСотрудники.ВидАттестации КАК ВидАттестации,
	|	ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизацииСотрудники.ДатаНачалаОбучения КАК ДатаНачалаОбучения,
	|	ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизацииСотрудники.ДатаОкончанияОбучения КАК ДатаОкончанияОбучения,
	|	ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизацииСотрудники.ДатаАттестации КАК ДатаАттестации,
	|	ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизацииСотрудники.ШЕ КАК ШЕ,
	|	ПРГ_СведенияОбАттестацииСотрудниковСрезПоследних.Регистратор КАК РегистраторОбучение,
	|	ПРГ_СведенияОбАттестацииСотрудниковСрезПоследних.ВидОперацииДокумента КАК ВидОбучение
	|ИЗ
	|	Документ.ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизации.Сотрудники КАК ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизацииСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПРГ_СведенияОбАттестацииСотрудников.СрезПоследних(&ДатаДок, ) КАК ПРГ_СведенияОбАттестацииСотрудниковСрезПоследних
	|		ПО ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизацииСотрудники.Сотрудник = ПРГ_СведенияОбАттестацииСотрудниковСрезПоследних.Сотрудник
	|			И ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизацииСотрудники.ШЕ = ПРГ_СведенияОбАттестацииСотрудниковСрезПоследних.ШЕ
	|			И ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизацииСотрудники.ВидАттестации = ПРГ_СведенияОбАттестацииСотрудниковСрезПоследних.ВидАттестации
	|ГДЕ
	|	ПРГ_ПроведениеАттестацииОбученияСотрудниковОрганизацииСотрудники.Ссылка = &Ссылка
	|	И ПРГ_СведенияОбАттестацииСотрудниковСрезПоследних.ВидОперацииДокумента = ЗНАЧЕНИЕ(Перечисление.ПРГ_ВидыОперацииДокументаАттестацииСотрудниковОрганизации.Обучение)";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("ДатаДок",Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей       = РегистрыСведений.ПРГ_СведенияОбАттестацииСотрудников.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.РегистраторОбучение);
		
		НаборЗаписей.Прочитать();
		
		Для каждого ЗаписьНабора из НаборЗаписей Цикл
			Если  ЗаписьНабора.Сотрудник = Выборка.Сотрудник и ЗаписьНабора.ВидАттестации = Выборка.ВидАттестации Тогда
				ЗаписьНабора.ДатаАттестации = Выборка.ДатаАттестации;
			КонецЕсли;
		КонецЦикла;
		
		НаборЗаписей.Записать();
				
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если мУдалятьДвижения и  Движения.Количество() > 0 Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = НСтр("ru = 'Проведение документа """ + СокрЛП(Ссылка) + """: '");
	
	СтрСообщения = "";
	
	//проверим заполнение	
	Если не ЗначениеЗаполнено(ВидАттестации) Тогда
		Отказ = Истина;
		СтрСообщения = "Не указан вид аттестации!!!";
	КонецЕсли;
	Если Сотрудники.Количество() = 0 Тогда
		Отказ = Истина;
		Если не СтрСообщения = "" Тогда
			СтрСообщения = СтрСообщения+Символы.ПС + "Не заполнена таблица с данными об аттестации (обучении)!!!";
		Иначе
			СтрСообщения = "Не заполнена таблица с данными об аттестации (обучении)!!!";
		КонецЕсли;
	КонецЕсли;
	Если не Отказ тогда
		СформироватьДвижения();
	Иначе
		Сообщить("Проведение НЕВОЗМОЖНО!!!"+Символы.ПС+СтрСообщения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры
